DeviceLogonEvents
| where IsLocalAdmin == 1
| where AccountName != ""
| summarize count() by AccountName, DeviceName
| sort by DeviceName asc

DeviceLogonEvents
| where IsLocalAdmin == 1
| where AccountName != ""
| summarize devicename=make_set(AccountName) by DeviceName
